<script setup lang="ts">

</script>

<template>
  <v-card title="降底高回报率外设输入延迟">
    <div class="text-body-2 mx-6">
      1.它到底是什么意思？这个指令通常出现在控制台或启动选项中，完整的逻辑如下：no: 不/禁止render: 渲染（画面显示）on_input_thread:<br/>
      在输入线程上在游戏运行过程中，电脑会处理两件大事：接收你的操作（鼠标点击/按键盘）和画出游戏画面。<br/>
      <br/>
      2.具体有什么作用？通常情况下，这个参数被认为能带来以下改进：降低输入延迟 (Input Latency):<br/>
      它强制要求游戏将“处理玩家输入”和“渲染游戏画面”这两个任务完全分开。这样即使画面渲染压力很大（掉帧时）<br/>
      系统也会优先保证你的鼠标移动和开火指令被实时捕捉，而不是被渲染任务堵住。解决“鼠标粘滞”感:<br/>
      很多职业玩家或追求极致竞技体验的用户使用它，是因为它能让准星移动感觉更加“跟手”，减少那种操作慢半拍的朦胧感。<br/>
      优化多核CPU 利用: 通过分离线程，可以让多核心 CPU 更有效地分配任务。<br/>
      <br/>
      3. 我应该使用它吗？优势风险/副作用理论上降低操作延迟，提升枪法上限。<br/>
      在某些配置较低的电脑上，可能会导致FPS（帧率）轻微下降。<br/>
      准星感觉更灵敏、直接。如果 CPU 性能极弱，可能会出现画面卡顿或掉帧（Stuttering）。<br/>
      <br/>
      4. 如何设置？如果你想在Origin 或 Steam 上尝试<br/>
      步骤如下：打开 Steam 库，右键点击 Apex Legends。选择 属性 -> 通用。<br/>
      在启动选项框中输入：+no_render_on_input_thread（注意前面通常要加 + 或 -，取决于游戏引擎的读取方式，Apex 通常用+）。<br/>
      <br/>
      建议：如果你拥有一台中高配置的电脑，且对射击延迟非常敏感，建议开启。<br/>
      你可以进入训练场试下甩枪的感觉，如果觉得画面变卡了，随时删掉这个指令即可。<br/>
      <p class="error_color">tips:由于俺没有高回报率外设，所以这个参数可能无效，请自行测试</p>
    </div>
  </v-card>
</template>

<style scoped>

</style>